RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/usb/device/usb_device_ehci.c
            /* Save the original buffer address. */
            if (NULL == message.buffer)
            {
                message.buffer = (uint8_t *)((currentDtd->bufferPointerPage[0] & USB_DEVICE_ECHI_DTD_PAGE_MASK) |
                                             (currentDtd->reservedUnion.originalBufferInfo.originalBufferOffest));
            }

            /* Remove the dtd from the dtd in-used queue. */
            if (ehciState->dtdHard[index] == ehciState->dtdTail[index])
            {
                ehciState->dtdHard[index] = NULL;
                ehciState->dtdTail[index] = NULL;
            }
            else
            {
                ehciState->dtdHard[index] = (usb_device_ehci_dtd_struct_t *)ehciState->dtdHard[index]->nextDtdPointer;
            }

            /* When the ioc is set or the dtd queue is empty, the up layer will be notified. */
            if ((currentDtd->dtdTokenUnion.dtdTokenBitmap.ioc) ||
                    (0 == ((uint32_t)ehciState->dtdHard[index] & USB_DEVICE_ECHI_DTD_POINTER_MASK)))
            {
                message.code = ep;
                message.isSetup = 0U;
                USB_DeviceNotificationTrigger(ehciState->deviceHandle, &message);
                message.buffer = NULL;
            }
            /* Clear the token field. */
            currentDtd->dtdTokenUnion.dtdToken = 0U;
            /* Save the dtd to the free queue. */
            currentDtd->nextDtdPointer = (uint32_t)ehciState->dtdFree;
            ehciState->dtdFree = currentDtd;
            ehciState->dtdCount++;
        }
        /* Get the next dtd. */
        currentDtd =
            (usb_device_ehci_dtd_struct_t *)((uint32_t)ehciState->dtdHard[index] & USB_DEVICE_ECHI_DTD_POINTER_MASK);
    }
    if (!currentDtd)
    {
        /* Set the QH to empty. */
        ehciState->qh[index].nextDtdPointer = USB_DEVICE_ECHI_DTD_TERMINATE_MASK;
        ehciState->qh[index].dtdTokenUnion.dtdToken = 0U;
    }
    USB_OSA_EXIT_CRITICAL();
    return kStatus_USB_Success;
}

/*!
 * @brief Control the status of the selected item.
 *
 * The function is used to control the status of the selected item.
 *
 * @param ehciHandle      Pointer of the device EHCI handle.
 * @param type             The selected item. Please refer to enumeration type usb_device_control_type_t.
 * @param param            The param type is determined by the selected item.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceEhciControl(usb_device_controller_handle ehciHandle, usb_device_control_type_t type, void *param)
{
    usb_device_ehci_state_struct_t *ehciState = (usb_device_ehci_state_struct_t *)ehciHandle;
    usb_status_t error = kStatus_USB_Error;
    uint16_t *temp16;
    uint8_t *temp8;
#if (defined(USB_DEVICE_CHARGER_DETECT_ENABLE) && (USB_DEVICE_CHARGER_DETECT_ENABLE > 0U)) && \
    (defined(FSL_FEATURE_SOC_USBHSDCD_COUNT) && (FSL_FEATURE_SOC_USBHSDCD_COUNT > 0U))
    usb_device_dcd_state_struct_t *dcdHSState;
    dcdHSState =
        &s_UsbDeviceDcdHSState[ehciState->controllerId - kUSB_ControllerEhci0]; /*The hard code should be replaced*/
    usb_device_dcd_charging_time_t *deviceDcdTimingConfig = (usb_device_dcd_charging_time_t *)param;
#endif
#if ((defined(USB_DEVICE_CONFIG_REMOTE_WAKEUP)) && (USB_DEVICE_CONFIG_REMOTE_WAKEUP > 0U))
    usb_device_struct_t *deviceHandle;
    uint64_t startTick;
#endif

    if (!ehciHandle)
    {
        return kStatus_USB_InvalidHandle;
    }

#if ((defined(USB_DEVICE_CONFIG_REMOTE_WAKEUP)) && (USB_DEVICE_CONFIG_REMOTE_WAKEUP > 0U))
    deviceHandle = (usb_device_struct_t *)ehciState->deviceHandle;
#endif

    switch (type)
    {
    case kUSB_DeviceControlRun:
        ehciState->registerBase->USBCMD |= USBHS_USBCMD_RS_MASK;
        error = kStatus_USB_Success;
        break;
    case kUSB_DeviceControlStop:
        ehciState->registerBase->USBCMD &= ~USBHS_USBCMD_RS_MASK;
        error = kStatus_USB_Success;
        break;
    case kUSB_DeviceControlEndpointInit:
        if (param)
        {
            error = USB_DeviceEhciEndpointInit(ehciState, (usb_device_endpoint_init_struct_t *)param);
        }
        break;
    case kUSB_DeviceControlEndpointDeinit:
        if (param)
        {
            temp8 = (uint8_t *)param;
            error = USB_DeviceEhciEndpointDeinit(ehciState, *temp8);
        }
        break;
    case kUSB_DeviceControlEndpointStall:
        if (param)
        {
            temp8 = (uint8_t *)param;
            error = USB_DeviceEhciEndpointStall(ehciState, *temp8);
        }
        break;
    case kUSB_DeviceControlEndpointUnstall:
        if (param)
        {
            temp8 = (uint8_t *)param;
            error = USB_DeviceEhciEndpointUnstall(ehciState, *temp8);
        }
        break;
    case kUSB_DeviceControlGetDeviceStatus:
        if (param)
        {
            temp16 = (uint16_t *)param;
            *temp16 = (USB_DEVICE_CONFIG_SELF_POWER << (USB_REQUEST_STANDARD_GET_STATUS_DEVICE_SELF_POWERED_SHIFT))
#if ((defined(USB_DEVICE_CONFIG_REMOTE_WAKEUP)) && (USB_DEVICE_CONFIG_REMOTE_WAKEUP > 0U))
                      | (deviceHandle->remotewakeup << (USB_REQUEST_STANDARD_GET_STATUS_DEVICE_REMOTE_WARKUP_SHIFT))
#endif
                      ;
            error = kStatus_USB_Success;
        }
        break;
    case kUSB_DeviceControlGetEndpointStatus:
        if (param)
        {
            usb_device_endpoint_status_struct_t *endpointStatus = (usb_device_endpoint_status_struct_t *)param;
            uint8_t ep = (endpointStatus->endpointAddress) & USB_ENDPOINT_NUMBER_MASK;
            uint8_t direction =
                ((endpointStatus->endpointAddress) & USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_MASK) >>
                USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT;

            if (ep < USB_DEVICE_CONFIG_ENDPOINTS)
            {
                if (ep)
                {
                    endpointStatus->endpointStatus = (ehciState->registerBase->EPCR[ep - 1U] &
                                                      (direction ? USBHS_EPCR_TXS_MASK : USBHS_EPCR_RXS_MASK)) ?
                                                     kUSB_DeviceEndpointStateStalled :
                                                     kUSB_DeviceEndpointStateIdle;
                }
                else
                {
                    endpointStatus->endpointStatus =
                        (ehciState->registerBase->EPCR0 & (direction ? USBHS_EPCR_TXS_MASK : USBHS_EPCR_RXS_MASK)) ?
                        kUSB_DeviceEndpointStateStalled :
                        kUSB_DeviceEndpointStateIdle;
                }
                error = kStatus_USB_Success;
            }
        }
        break;
    case kUSB_DeviceControlSetDeviceAddress:
        if (param)
        {
            temp8 = (uint8_t *)param;
            ehciState->registerBase->DEVICEADDR = (((uint32_t)(*temp8)) << USBHS_DEVICEADDR_USBADR_SHIFT);
            error = kStatus_USB_Success;
        }
        break;
    case kUSB_DeviceControlGetSynchFrame:
        break;
#if (defined(USB_DEVICE_CONFIG_LOW_POWER_MODE) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
#if defined(USB_DEVICE_CONFIG_REMOTE_WAKEUP) && (USB_DEVICE_CONFIG_REMOTE_WAKEUP > 0U)
    case kUSB_DeviceControlResume:
#if (defined(FSL_FEATURE_SOC_USBNC_COUNT) && (FSL_FEATURE_SOC_USBNC_COUNT > 0U))
        ehciState->registerNcBase->USB_OTGn_CTRL &= ~USBNC_USB_OTGn_CTRL_WIE_MASK;
#else
        ehciState->registerBase->USBGENCTRL &= ~USBHS_USBGENCTRL_WU_IE_MASK;
#endif
        ehciState->registerBase->PORTSC1 &= ~USBHS_PORTSC1_PHCD_MASK;
        ehciState->registerBase->PORTSC1 |= USBHS_PORTSC1_FPR_MASK;
        startTick = deviceHandle->hwTick;
        while ((deviceHandle->hwTick - startTick) < 10)
        {
            __ASM("nop");
        }
        ehciState->registerBase->PORTSC1 &= ~USBHS_PORTSC1_FPR_MASK;
        error = kStatus_USB_Success;
        break;
#endif /* USB_DEVICE_CONFIG_REMOTE_WAKEUP */
    case kUSB_DeviceControlSuspend:
        ehciState->registerBase->OTGSC |= 0x007F0000U;
        ehciState->registerPhyBase->PWD = 0xFFFFFFFF;
        /* ehciState->registerBase->OTGCTL |= ((1U<<10) | (1U<<17) | (1U<<16)); */
        while (ehciState->registerPhyBase->CTRL & (USBPHY_CTRL_UTMI_SUSPENDM_MASK))
        {
            __ASM("nop");
        }
        /* ehciState->registerPhyBase->CTRL |= ((1U << 21) | (1U << 22) | (1U << 23)); */
        ehciState->registerBase->USBSTS |= USBHS_USBSTS_SRI_MASK;
        ehciState->registerBase->PORTSC1 |= USBHS_PORTSC1_PHCD_MASK;
#if (defined(FSL_FEATURE_SOC_USBNC_COUNT) && (FSL_FEATURE_SOC_USBNC_COUNT > 0U))
        ehciState->registerPhyBase->CTRL |= USBPHY_CTRL_ENVBUSCHG_WKUP_MASK | USBPHY_CTRL_ENIDCHG_WKUP_MASK |
                                            USBPHY_CTRL_ENDPDMCHG_WKUP_MASK | USBPHY_CTRL_ENIRQRESUMEDETECT_MASK;
        ehciState->registerNcBase->USB_OTGn_CTRL |= USBNC_USB_OTGn_CTRL_WKUP_ID_EN_MASK |
                USBNC_USB_OTGn_CTRL_WKUP_VBUS_EN_MASK |
                USBNC_USB_OTGn_CTRL_WKUP_DPDM_EN_MASK;
        ehciState->registerNcBase->USB_OTGn_CTRL |= USBNC_USB_OTGn_CTRL_WIE_MASK;
#else
        ehciState->registerBase->USBGENCTRL = USBHS_USBGENCTRL_WU_IE_MASK;
#endif
        ehciState->registerPhyBase->CTRL |= USBPHY_CTRL_CLKGATE_MASK;
        ehciState->isSuspending = 1U;
        error = kStatus_USB_Success;
        break;
#endif /* USB_DEVICE_CONFIG_LOW_POWER_MODE */
    case kUSB_DeviceControlSetDefaultStatus:
        for (uint8_t count = 0U; count < USB_DEVICE_CONFIG_ENDPOINTS; count++)
        {
            USB_DeviceEhciEndpointDeinit(ehciState, (count | (USB_IN << 0x07U)));
            USB_DeviceEhciEndpointDeinit(ehciState, (count | (USB_OUT << 0x07U)));
        }
        USB_DeviceEhciSetDefaultState(ehciState);
        error = kStatus_USB_Success;
        break;
    case kUSB_DeviceControlGetSpeed:
        if (param)
        {
            temp8 = (uint8_t *)param;
            *temp8 = ehciState->speed;
            error = kStatus_USB_Success;
        }
        break;
    case kUSB_DeviceControlGetOtgStatus:
        break;
    case kUSB_DeviceControlSetOtgStatus:
        break;
#if (defined(USB_DEVICE_CONFIG_USB20_TEST_MODE) && (USB_DEVICE_CONFIG_USB20_TEST_MODE > 0U))
    case kUSB_DeviceControlSetTestMode:
        if (param)
        {
            temp8 = (uint8_t *)param;
            ehciState->registerBase->PORTSC1 |= ((uint32_t)(*temp8) << 16U);
            error = kStatus_USB_Success;
        }
        break;
#endif
#if (defined(USB_DEVICE_CHARGER_DETECT_ENABLE) && (USB_DEVICE_CHARGER_DETECT_ENABLE > 0U)) && \
    (defined(FSL_FEATURE_SOC_USBHSDCD_COUNT) && (FSL_FEATURE_SOC_USBHSDCD_COUNT > 0U))
    case kUSB_DeviceControlDcdInitModule:
        dcdHSState->dcdRegisterBase->CONTROL |= USBDCD_CONTROL_SR_MASK;
        dcdHSState->dcdRegisterBase->TIMER0 = USBDCD_TIMER0_TSEQ_INIT(deviceDcdTimingConfig->dcdSeqInitTime);
        dcdHSState->dcdRegisterBase->TIMER1 = USBDCD_TIMER1_TDCD_DBNC(deviceDcdTimingConfig->dcdDbncTime);
        dcdHSState->dcdRegisterBase->TIMER1 |= USBDCD_TIMER1_TVDPSRC_ON(deviceDcdTimingConfig->dcdDpSrcOnTime);
        dcdHSState->dcdRegisterBase->TIMER2_BC12 =
            USBDCD_TIMER2_BC12_TWAIT_AFTER_PRD(deviceDcdTimingConfig->dcdTimeWaitAfterPrD);
        dcdHSState->dcdRegisterBase->TIMER2_BC12 |=
            USBDCD_TIMER2_BC12_TVDMSRC_ON(deviceDcdTimingConfig->dcdTimeDMSrcOn);
        dcdHSState->dcdRegisterBase->CONTROL |= USBDCD_CONTROL_IE_MASK;
        dcdHSState->dcdRegisterBase->CONTROL |= USBDCD_CONTROL_BC12_MASK;
        dcdHSState->dcdRegisterBase->CONTROL |= USBDCD_CONTROL_START_MASK;
        break;
    case kUSB_DeviceControlDcdDeinitModule:
        dcdHSState->dcdRegisterBase->CONTROL |= USBDCD_CONTROL_SR_MASK;
        break;
#endif

    default:
        break;
    }

    return error;
}

/*!
 * @brief Handle the EHCI device interrupt.
 *
 * The function is used to handle the EHCI device interrupt.
 *
 * @param deviceHandle    The device handle got from USB_DeviceInit.
 *
 */
void USB_DeviceEhciIsrFunction(void *deviceHandle)
{
    usb_device_struct_t *handle = (usb_device_struct_t *)deviceHandle;
    usb_device_ehci_state_struct_t *ehciState;
    uint32_t status;

    if (NULL == deviceHandle)
    {
        return;
    }

